[
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: Hello, my name is Carolyn.  How are you feeling today?\nseeker: Hello, my name is Nicholas. I am feeling a bit tired today, how are you Carolyn?\nsupporter: I'm a bit tired too to be honest!   Is there anything you'd like to talk about today?  I'm ready to listen :)\nseeker: I have been tired a lot lately, even when I sleep for 8 hours. I am not sure what to really do to help myself gain more energy and recover my sleeping schedule to normal.\n\nsupporter: I see.  Are you finding it hard to function on not enough sleep?  I have experienced that at times as well, and found it quite frustrating!\nsupporter: How much sleep are you getting now?   Do you keep irregular sleep hours, e.g. the time you go to bed and get up?\nseeker: Yes, I had a bad sleeping schedule, when I would go to sleep around 2-3am. I now get around 8 hours of sleep but I feel like it isn't enough still.\nseeker: Would this relate to a health problem of not being active or maybe stress?\nsupporter: I used to be a night owl, going to bed early in the morning.  I reset my schedule very gradually.  I went to bed 15 minutes earlier, and set an alarm for 8 hours later.  I did that for 3 days, then I would ratchet it back another 15 minutes.   It was a gradual process and the only way I could fix it.\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "1",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "0",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Are you getting any exercise during the daytime?"
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: Hi there, how can I help you today?\nseeker: I'm sad because I found out my boyfriend broke up with me once he saw I came from a poor neighborhood.\nsupporter: That's terrible. How awful he is\nseeker: Yes, I kind of depressed over it though because I thought he loved me.\nsupporter: I understand how you feel, especially when you're looked down by the one you care the most\nseeker: I wish I had a different home, but I can't change that now.  I'm trying to work so hard to do better, but it will take time.\nsupporter: It is not your fault. It's actually your ex's problem. There is nothing to feel ashamed of\nseeker: Thanks for the encouragement.\nsupporter: You can actually use this as a motivation to show your ex how much he missed\nseeker: I think he is missing out on a lot, but he isn't going to realize this now.\nsupporter: yes that's the right attitude. As long as you are determined, I believe you can do anything you want.\nseeker: Do you think someone else will love me for who I am?\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "9",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "5",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Of course, you will find the right one soon."
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: Hi how are you doing today?\nseeker: I am feeling very upset because of my situation. \nsupporter: would you like to tell me more about it?\nseeker: Yes. My friend, M, is my oldest friend and knows me the best. If I can't turn to her for help, then who can I turn to?\nsupporter: Why do you feel you can't turn to your friend?\nseeker: She is always so depressed herself. She is too tired, she is too sad, she is too frustrated. Everyone has hard lives, but we all do our best to deal with it. I have a child with special needs and I need help too, but she never thinks to ask about me and see if I am not doing okay\nsupporter: I am sorry to hear that sounds like she sure could use some help as well. Have you tried first taking about her issues and then telling her about yours?\nseeker: I talk about her issues constantly. I guess I could do a better job about letting her know when I am feeling down. I just ask her to do things with me instead, but maybe she just takes it at face value. Literally everytime we talk though, it's about her problems.\nseeker: But she never does anything to try and fix them.\nsupporter: I am sorry to her that, so it sounds like you feel you need to give her help but you dont get any from her. But is also sounds like she might not be aware of you needing help. \nseeker: Yes, exactly. \nseeker: It would be nice if I didn't have to explicitly spell it out. It makes it seem less meaningful when I have to spoonfeed to her what is wrong and what I need her to do for me.\nsupporter: I think you need to try to tell her about your problems, and maybe even if she feels like she is helping you she is more inclined to help herself some too?\nseeker: That's true, I didn't think about that really. Helping others def can help to take the focus off of yourself.\nsupporter: I know, it would be nice of her to ask how are you? But maybe she thinks you are a very strong person that does not need help since you do not voice it.?\nseeker: Yeah, that is true. I guess I am not looking at it from her persepctive.\nsupporter: Yes the feeling that you help someone can be uplifting and good for anyones ego\n\nseeker: Should I tell her that I am frustrated with her lack of helping me or just try to put that behind me?\nseeker: What is a good way to broach that I need help. Like I guess I don't know how to bring it up organically in a conversation\nsupporter: I would try to find a conversation and then tell her like sometimes I could use help with whatever and then tell her that you feel lonely and need her sometimes as well\nseeker: Okay, I can try that. I guess I get so caught up in the frustration and my expectations of her, that I don't give it a chance.\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "0",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "1",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Give it a try and you are not alone as you see we had a nice conversation."
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: Hello how are you?\nseeker: I am down feeling depressed \nseeker: I feel like the world is crashing down around me\nsupporter: I have suffered from depression and know how hard that can be\nsupporter: What seems to have brought it on?\nseeker: Thinking about my kids and wanting to be able to hug them and see them they are in a different state\nseeker: I have medications I take but I have so many different things going on\nsupporter: Oh that is hard being separated from family.  Are you unable to t5ravel right now?\nseeker: I have PTSD, sleep apnea, and numerous other issues I suffer from as well\nsupporter: I see\nsupporter: So are you being followed by a specialist?\nseeker: It is hard to travel at the moment I feel I can't trust anyone and don't like to be around a lot of people\nseeker: I do see a specialist\nsupporter: Okay so you are not feeling well enough to travel and see your kids am I right?\nseeker: It's even hard for me to go outside \nseeker: No I am feeling very down and depressed right now and it is very hard\nsupporter: That sounds like it would be isolating...are you able to keep in touch with people by telephone, video chat and what not, are you feeling well enough for that?\nseeker: My kids call me and facetime me \nsupporter: I know when I am depressed I don't want to see or talk to anyone...\nseeker: My oldest son texts me a lot so I am thankful for that\nsupporter: Oh I'm so glad you are in touch in that way, do you find them supportive?\nseeker: My kids make me happy to talk to but usually I don't feel like seeing anyone\nsupporter: Is there any way they can come and visit you?\nseeker: I don't even know how to describe how I feel to people sometimes\nseeker: I hope they will be coming soon when my youngest son gets out of school\nsupporter: It sounds like you are feeling overwhelmed right now.  \nseeker: My mood seems to go up and down but mostly stays down I don't like going anywhere \n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "2",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "2",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Is there anyone else besides your specialist and your kids that you can reach out to for support in your community, even if it's just by pone?"
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nseeker: hello\nsupporter: hi\n\n\nsupporter: how is your side? Please  how may I be of help\n\nseeker: I would just like someone to talk to, very reserved because of covid\nsupporter: I could see that you are indoor and bored because of the pandemic season \n\nseeker: yes very lonely and no one to talk to, world is so scary\nsupporter: everyone says  so, life is in circle,  you just need to keep on pushing\n it simultaneously. \nseeker: i try very hard but I don't know how much longer i can take it\nsupporter: do you have any hobby? that you can  use to wipe away time \nseeker: i like to watch soccer and basketball\nsupporter: I was once in that situation, but what helped me is that, I never give up, though I may be overwhelmed with the challenges and unpalatable situations ..... I keep on pressing it,  \n\nseeker: I will keep trying to make people proud\nsupporter: I am a lover of sport, just get use to it,  anytime you are down, take your phone and watch football or basket ball either on YouTube or any other means  .\nseeker: yes I will watch highlights and goals on YouTube very nice\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "2",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "5",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "that is what you need. Winner never quit !\n"
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: Hello, how are you doing today?\nseeker: I'm worried.  I lost my job and I'm worried I won't get another one.\nsupporter: I'm so sorry to hear that, this has been a hard time for so many.\n\nseeker: Yes, it has been.  I just really feel lost.\nsupporter: What type of work were you doing if I can ask?\nseeker: Project Coordinator.\nsupporter: What field?\nseeker: Construction\nsupporter: I'm so sorry. Is there any side work you can get into?\nseeker: Maybe.  I'm looking for work from home jobs in the meantime while looking for jobs\nsupporter: That's a great idea, I'm glad you're looking into things to do in the meantime.\nseeker: I'm going to miss the people I worked with as well.\nsupporter: Unfortunately, this is such an isolating time and losing some of that contact is going to be an adjustment. I can completely understand that.\nseeker: Yes.  it is.  I know that we'll get through this whole thing, but in the meantime it's just so crazy making and anxiety inducing.\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "1",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "4",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "I can definitely relate to that. The amount of anxiety this has all caused is more than I could've ever imagined. The important thing is that we reach out and talk about things in order to help reset and deal with what's going on.\n"
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nsupporter: hello how are you?\n\nseeker: I don't know how to get over this\nseeker: I'm just alright.\nsupporter: You are having some trouble getting over something is that correct? \nsupporter: Why are you feeling just alright? \nseeker: I'm feeling just alright because nothing excites me or gives me joy anymore. Many of my family have passed on and the holidays are coming. \nsupporter: I understand that it is hard to have some type of joy especially with the holidays coming along especially when family has passed on. \nseeker: This pandemic doesn't help either. No gatherings with many people. \nsupporter: I know it is hard, it also has taken a toll on me as well this pandemic is hard to go through, but I take it day by day. Maybe you should take to someone if there is anyone close to you?\nseeker: Only my Aunt, but I haven't talked to her in a long time. I just figure she's busy. \n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "9",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "2",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "maybe you should try to call her sometime im sure she would like that "
    },
    {
      "system": "You are an emotional support assistant. Perform the following three sequential tasks:\n1. Analyze the dialogue history to select the optimal emotion ID of the seeker.\n2. Based on the identified emotional state, analyze the dialogue history again to select the most appropriate strategy ID.\n3. Generate a response strictly adhering to the selected strategy and the identified emotional state.",
      "input": "### History\n<history>:\nseeker: hi\n.\n\n### Task\nAs an emotion-sensing assistant, analyze the emotional state of the current seeker based on the conversation history and select the appropriate ID from the candidats.\n\nEmotion list:\n{0: 'anger', 1: 'anxiety', 2: 'depression', 3: 'disgust', 4: 'fear', 5: 'guilt', 6: 'jealousy', 7: 'nervousness', 8: 'pain', 9: 'sadness', 10: 'shame'}\n\nAnswer:\n",
      "think_1": "4",
      "subtask_1": "### Task\nAs the supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think_2": "1",
      "subtask_2": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Hey! How are you?"
    }
]