[
    {
      "system": "You are an emotional support assistant. Perform two sequential tasks:\n1. Analyze the user's state and dialogue history to select the optimal strategy ID.\n2. Generate a response strictly adhering to the selected strategy.",
      "input": "### Emotion:\nsadness\n\n### History\n<history>:\nsupporter: Hi, how are you feeling tonight? Is there anything I can help you with?\nseeker: hi\nseeker: feeling upset\nsupporter: I'm sorry to hear that. Can I talk you through what you're experiencing?\nseeker: i am sad because of my love\nsupporter: That's frustrating to hear. What is your love?\nseeker: its gone, she left me\nsupporter: That's awful. I'm so sorry to hear that. How did it happen?\nseeker: she is married to a rich man\nsupporter: Is there any way you feel you can move on from her?\nseeker: she broke me down like a helpless bird\n \nseeker: i can over come from her memories\nsupporter: Were you in a relationship with her?\nseeker: yes i've been in a relationship with her for three years\nsupporter: If she has moved on from you, as painful as it is, you should move on from her. But that will take time, and it will help to slowly and methodically find a way forward from her. You should not feel like it will happen overnight or that quickly, but distractions and creating a new path for yourself are imperative.\nseeker: I cound not stop remember her memories, its repeating and disturbing for all way\nsupporter: For now, that is a normal feeling and reaction, but with therapy and some help, that will lessen in frequency and severity. Have you tried meditation?\nseeker: yes but it is not so effective towards me\nsupporter: How about a therapist, if only temporarily?\nseeker: yes because of the pandemic no one will provide a proper theraphy\nsupporter: There are many support groups online you can try. I would contact your PCP who can try to get you in touch with someone who could help.\nseeker: do you know anyone\nsupporter: not online, only locally, and I don't know where you live, sorry.\nseeker: its okey, i will find by myself\nsupporter: I have to get going, but I encourage you to find a support group or contact a physician asking for a recommendation. Perhaps ask friends you're comfortable with. Keep in mind that this is only temporary and designed to help you not just move on, but grow stronger from this.\nseeker: im physically fit but mentally hurt by her\nseeker: and thats my problem\nsupporter: Yes, but mental pain can lead you down a dark path. It is best to catch it while you can, before it is significant.\nseeker: i will try to recover from it\nsupporter: Thank you, be well, stay positive and know that there are bright days ahead.\nseeker: try to find the right way to get my way\nsupporter: That's always the challenge. But one worth fighting for :)\nseeker: yes it is challenging\n.\n\n### Task\nAs the Supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think": "3",
      "subtask": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "I must get going, have a wonderful night and be strong. I believe in you."
    },
    {
      "system": "You are an emotional support assistant. Perform two sequential tasks:\n1. Analyze the user's state and dialogue history to select the optimal strategy ID.\n2. Generate a response strictly adhering to the selected strategy.",
      "input": "### Emotion:\nfear\n\n### History\n<history>:\nsupporter: Hello what's going on?\n\nseeker: Hello.\nsupporter: Hey :)\n\nseeker: I just found out that I will be losing my job. I have no clue what to do. \nsupporter: I was in a similar situation a short while back I can understand if you feel anxious and stressed.\nsupporter: Was it due to the pandemic?\nseeker: Yes it is. We haven't gotten the funding form the government and we are a small business. I am not sure how to tell my wife.\nsupporter: So if I understand the anxiety of you losing your job is increased because you also have to give your wife the news?\nseeker: Yes and I also have to find some place else to work at. \nsupporter: If where you live has some form of unemployment insurance it may be a good time to apply for it if your comfortable with that since you are aware your job is coming to an end \nseeker: Not a bad idea. I will look into that for sure. I am not sure how long it will take to get it. I'm not to bad off because I do have savings but I am just worried that I will not be able to find any work around where I live and I don't want to move.\nsupporter: It's completly understandable that telling your wife is additionally difficult since it's life effecting news and you are probably worried about the effect the news will have on your wife\n\nseeker: Yes for sure. She has her job so it just would feel weird for me to be at home while she works. \nsupporter: In my case I am still currently in school and lack credentials but I've managed to find some online work that is getting me by\nseeker: I never have thought about online work. That might be a good idea.\nsupporter: You may want to budget relevant areas of yur spending ahead of time so your savings will go longer but Isuggest not to the point that it effects your mental well being\n\nsupporter: Also if your on good terms maybe get references\n\nseeker: That is a great idea. I am sure I can get references. My boss loves me.  He said he is looking to help me any way he can.\nsupporter: I don't drive so my options were limited to avoid riding the bus I do recommend getting out of you living space other ways if you work online but its all right\nsupporter: I think with that kind of connection with your boss especially with your job loss being circumstantial you should have a really good starting point\n\nseeker: I am going to look online for sure. I would like to work form home.\nseeker: I am sure with my IT degree I can find some online jobs.\nsupporter: It does have benefits you save money on transportation costs for example :)\n\nsupporter: That is actually along the lines of what I'm doing on the low end of the totem pole Not the high paying jobs but the basic and intermediate seems to be a fair bit available\n\nsupporter: I don't male much but Ihave flexible hours and still finishing my degree\n\n.\n\n### Task\nAs the Supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think": "0",
      "subtask": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "How are you currently feeling about your situation with a little bit of a plan in place?"
    },
    {
      "system": "You are an emotional support assistant. Perform two sequential tasks:\n1. Analyze the user's state and dialogue history to select the optimal strategy ID.\n2. Generate a response strictly adhering to the selected strategy.",
      "input": "### Emotion:\nanxiety\n\n### History\n<history>:\nsupporter: Hello\nseeker: hello\nsupporter: What's on your mind?\nseeker: I have real bad anxiety about the possible 2nd shut down due to the rise in Covid \nseeker: so many people lost their job during the first shut down\nsupporter: We are on the same boat\nseeker: its extremely draining\n.\n\n### Task\nAs the Supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think": "3",
      "subtask": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "I understand how you feel. I think others feel the same too, that we're exhausted no matter if we're directly  affected or not"
    },
    {
      "system": "You are an emotional support assistant. Perform two sequential tasks:\n1. Analyze the user's state and dialogue history to select the optimal strategy ID.\n2. Generate a response strictly adhering to the selected strategy.",
      "input": "### Emotion:\ndisgust\n\n### History\n<history>:\nseeker: Hello\nsupporter: Hey! How can I help?\nseeker: So I don't know if you can see the topic of my problem like I can see on my screen?\nseeker: If not I'll explain\nsupporter: Yes please do\n\nseeker: So I had a long time friend who recently blocked me from everything. The reason was I refused to hang out with her during covid and she questioned our friendship. Something she said was \"It's selfish of me to work rather than spend time with a special\n friend.\" \nseeker: So I got upset and called her out. And in response she blocked me.\nseeker: And I'm more upset at myself because I wanted to tell her more about how horrible of a human being she is in general. \nseeker: But I cannot because she blocked me on everything.\n.\n\n### Task\nAs the Supporter in the conversation, choose the appropriate strategy from the candidates and output the corresponding number ID.\n\nStrategy list:\n{0: 'Question', 1: 'Others', 2: 'Providing Suggestions', 3: 'Affirmation and Reassurance', 4: 'Self-disclosure', 5: 'Reflection of feelings', 6: 'Information', 7: 'Restatement or Paraphrasing'}\n\nAnswer:\n",
      "think": "3",
      "subtask": "As the supporter in this conversation, based on the above information and your chosen strategy, continue to respond to the conversation.\n\nAnswer:\n",
      "assistant": "Have you explained to her that you NEED to work, and don't be upset with yourself because you did the right thing\n"
    }
]
